// Node.js 소개
// React.js 기술은 Node.js를 기반으로 동작하는 기술
// 그 외 Next.js, Vue.js, Svelte 기술도 Node.js 기반 기술

// Node.js는 웹브라우저가 아닌 환경에서도
// 자바스크립트를 실행시켜주는
// 자바스크립트 실행 환경 (Run Time = 구동기)

// 구동기는 예를들어 스위치처럼
// 자바스크립트 코드를 실행시켜주는 구동기
// 이러한 언어를 구동하는 구동기를 실행환경(런타임)이라고 부름

// 공식 정의
// Node.js는 Chrome V8 JavaScript 엔진으로
// 빌드된 JavaScript 런타임입니다.

// Node가 필요한 이유?
// 우선 자바스크립트의 히스토리를 살펴봐야함
// 자바스크립트는 원래 웹페이지 안에서의 단순한 기능만을
// 개발하기 위해 만들어진 간단한 스크립트 언어

// 예를들어 사용자가 웹에서 버튼을 클릭하면 경고창을 띄우거나
// 요소의 색상을 변경시킨다는 등 단순한 인터렉션 개발 목적
// 오직 웹브라우저 내에서만 동작하도록 개발됨
// 동시대 언어와 다르게 유연하고 작성하기 편한 코드
// 최대한 빠른 개발을 위해 생산성을 중심으로 언어가 설계됨

// 자바스크립트로 웹페이지 외부에서도 프로그램을 만들고자 함
// Node.js가 등장하면서 어디서든 동작할 수 있는 범용적 언어가 됨
// 이제는 자바스크립트로 웹서버, 모바일앱, 데스크톱 앱 등 개발 가능
