// Context 란

// 컴포넌트 간의 데이터를 전달하는 또 다른 방법
// 기존 Props가 가지고 있는 단점을 해결

// Props 단점 : Props Drilling
// Props는 부모 -> 자식 간 한단계씩 아래로 데이터 전달 (App -> ChildA -> ChildB)
// 한 번에 두단계 이상으로 데이터를 바로 전달하는 것은 불가능 (App -> X -> ChildB)
// 중간에 있는 모든 자식에게 props를 연달아 전달해야하는 단점

// 중간 자식 컴포넌트가 많아진다면 유지보수가 불편
// => React Context는 Props Drilling을 해결

// --------------------------------------------

// Context : 데이터 보관소 역할 (객체)
// 부모 컴포넌트(App)에서 자식에게 전달하는 모든 props를 Context에 보관
// 모든 계층에 자식 컴포넌트에서 필요한 데이터를
// props를 이용하지 않고 다이렉트로 공급받아 사용 가능
// Context를 여러개 만들어 각기 다른 Context 데이터만 공급받게 설정 가능
