// 페이지 라우팅 1. 소개

// 페이지 라우팅(Page Routing)이란?
// 경로에 따라 알맞은 페이지를 렌더링 하는 과정
// ex) /new -> new 페이지 렌더링

// Multi Page Application(MPA)
// 서버가 모든 페이지들의 HTML 파일을 가지는 방식
// 브라우저(client)가 특정 페이지를 요청하면 (/blog)
// 서버(server)는 해당 페이지를 그대로 반환(blog.html)

// 동작방식이 매우 직관적이여서 많은 서비스가 사용하는 전통적인 방식
// 단점은 원래 페이지를 다 지우고 새 페이지를 처음부터 렌더링하기 때문에
// 페이지 이동이 매끄럽지 않고 비효율적, 다수의 사용자 접속시 서버의 부하

// 서버 사이드 렌더링 (Server Side Rendering)
// 미리 완성되어 있는 페이지를 그대로 응답하는 방식

// MPA의 단점을 보완하기 위해 React는 SPA 방식 사용
// Single Page Application(SPA)
// 서버가 하나의 페이지만 가지는 방식 (index.html)
// + 여러개의 자바스크립트 파일 (리액트 컴포넌트, 기타 유틸 기능 등)

// 브라우저(client)가 특정 페이지를 요청하면 (/setting)
// 서버(server)는 일단 index.html 페이지를 반환
// 리액트에서 index.html는 기본적인 틀 역할을 하는 빈 페이지
// 화면에 실제로 렌더링해야하는 정보는 html이 아닌 JS에 컴포넌트로 작성

// 서버는 모든 자바스크립 파일을 하나로 묶어서 번들 파일을 추가로 전달
// 브라우저는 번들 파일을 직접 실행하여 모든 컴포넌트가 화면에 렌더링

// 클라이언트 사이드 렌더링 (Client Side Rendering)
// 클라이언트 측인 브라우저가 직접 렌더링을 처리하는 방식

// SPA 방식의 경우 새로운 페이지 이동이 발생하면
// 서버에 요청을 보내지 않고 브라우저가 자체적으로
// 번들 파일을 이용하여 필요한 컴포넌트들만 화면에 교체

// MPA -> 모든 요소 교체
// SPA -> 필요한 요소만 교체
